# language: zh-CN
功能: all1 top100网站回归测试

  场景大纲: pornhub系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮1
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户在当前页面点击坐标(0.5,0.61)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            |
      | www.pornhub.com |
      | es.pornhub.com  |
      | fr.pornhub.com  |
      | pt.pornhub.com  |

  场景大纲: redtube.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮1
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word           | x    | y    |
      | redtube.com    | 0.25 | 0.49 |
      | redtube.com.br | 0.25 | 0.49 |
      | txxx.com       | 0.5  | 0.38 |

  场景大纲: xhamster.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮2
    而且用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            | x    | y    |
      | xhamster.com    | 0.26 | 0.63 |
      | xhwide5.com     | 0.74 | 0.63 |
      | xhamster.desi   | 0.26 | 0.83 |
      | xhamster42.desi | 0.74 | 0.83 |

  场景大纲: spankbang.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮3
    当用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word             | x    | y    |
      | la.spankbang.com | 0.74 | 0.57 |
      | spankbang.com    | 0.27 | 0.57 |

  场景: dailymotion.com网站回归测试
    当用户在首页点击dailymotion图标
    而且用户在当前页面点击坐标(0.5,0.42)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景大纲: xvideos系列网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户在当前页面点击坐标(0.5,0.34)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            |
      | www.xvideos.com |
      | www.xvideos.es  |

  场景大纲: xnxx系列网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.6)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户在当前页面点击坐标(0.5,0.51)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word                |
      | www.xnxx.es         |
      | www.xnxx-arabic.com |
      | www.xnxx2.com       |
      | www.xnxx.com        |
      | www.xnxx.tv         |
      | www.txnhh.com       |

  场景大纲: 单个或多个视频网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word                    | x    | y    |
      | www.sex1x.com           | 0.5  | 0.51 |
      | www.xnx33.com           | 0.5  | 0.51 |
      | xnxxsex.net             | 0.5  | 0.35 |
      | www.tokyvideo.com       | 0.5  | 0.35 |
      | www.kobiiys.com         | 0.75 | 0.28 |
      | 3gpking.name            | 0.74 | 0.31 |
      | www.serviporno.com      | 0.74 | 0.29 |
      | kompoz2.com             | 0.75 | 0.28 |
      | www.superporn.com       | 0.5  | 0.35 |
      | yatv.red                | 0.74 | 0.36 |
      | yako.pro                | 0.25 | 0.47 |
      | www.clip2vip.com        | 0.5  | 0.6  |
      | www.porndotcom.org      | 0.74 | 0.34 |
      | xnxx.com.se             | 0.5  | 0.51 |
      | 3rabxn.com              | 0.5  | 0.54 |
      | arab-xn.com             | 0.5  | 0.59 |
      | www.wapoz.info          | 0.74 | 0.26 |
      | ijavhd.com              | 0.75 | 0.62 |
      | pornocarioca.com        | 0.73 | 0.49 |
      | bucetaflix.com          | 0.26 | 0.61 |
      | hdsex.org               | 0.5  | 0.4  |
      | fngml.com               | 0.5  | 0.45 |
      | xvideosporno.blog.br    | 0.5  | 0.54 |
      | www.eporner.com         | 0.25 | 0.56 |
      | www.arbada.com          | 0.5  | 0.55 |
      | www.ixxx1.com           | 0.5  | 0.73 |
      | sexalarab.com           | 0.5  | 0.45 |
      | www.aparat.com          | 0.5  | 0.51 |
      | www.watchxn.com         | 0.5  | 0.73 |
      | pornhat.video           | 0.73 | 0.39 |
      | fpo.xxx                 | 0.5  | 0.53 |
      | tv.naver.com            | 0.5  | 0.37 |
      | porndig.com             | 0.75 | 0.47 |
      | xlxx69.com              | 0.5  | 0.51 |
      | pornes.xxx              | 0.75 | 0.34 |
      | tnaflix.com             | 0.51 | 0.64 |
      | pornoeggs.com           | 0.5  | 0.51 |
      | tukif.com               | 0.75 | 0.49 |
      | mrvideospornogratis.xxx | 0.5  | 0.59 |
      | www.xvideos-ar.com      | 0.5  | 0.34 |
      | www.xvv1deos.com        | 0.5  | 0.34 |
      | sex-arabe.com           | 0.5  | 0.45 |
      | cinepornogratis.com     | 0.5  | 0.49 |
      | cnnamador.com           | 0.5  | 0.71 |
      | www.arabxn.com          | 0.5  | 0.73 |
      | xxvidsx.com             | 0.69 | 0.35 |

  场景大纲: 搜索类网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户在搜索框输入"<txt>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.48)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word               | txt  |
      | noodlemagazine.com | more |
      | mat6tube.com       | more |

  场景大纲: 打开新窗口类网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    而且用户检查工具栏窗口
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            | x    | y    |
      | sex-arebi.com   | 0.5  | 0.51 |
      | sex4arab.xxx    | 0.5  | 0.5  |
      | filmesporno.xxx | 0.75 | 0.5  |
      | sex-alarabi.com | 0.5  | 0.49 |
      | sexmtrgm.com    | 0.5  | 0.49 |
      | sexsati.com     | 0.74 | 0.47 |

  场景: xnxx.health网站回归测试
    当用户在首页搜索框输入"xnxx.health"
    而且用户在当前页面点击坐标(0.5,0.81)
    而且用户检查工具栏窗口
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户在当前页面点击坐标(0.5,0.68)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: sexallarab.com网站回归测试
    当用户在首页搜索框输入"sexallarab.com"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.46)
    而且用户在当前页面点击播放按钮1
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: www.arabx.cam网站回归测试
    当用户在首页搜索框输入"www.arabx.cam"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.47)
    而且用户检查工具栏窗口
    而且用户在当前页面点击播放按钮2
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: jerk24.com网站回归测试
    当用户在首页搜索框输入"jerk24.com"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.75,0.39)
    而且用户在当前页面点击坐标(0.75,0.55)
    而且用户在当前页面点击播放按钮2
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: sm3ha.mx网站回归测试
    当用户在首页搜索框输入"sm3ha.mx"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.39)
    而且用户在当前点击结果1
    而且用户在当前页面点击播放按钮3
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景大纲: tubev、kudosporn网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x1>,<y1>)
    而且用户在当前页面点击坐标(<x2>,<y2>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word          | x1   | y1   | x2   | y2   |
      | www.tubev.sex | 0.73 | 0.52 | 0.73 | 0.64 |
      | kudosporn.com | 0.75 | 0.54 | 0.75 | 0.44 |

  场景: xvideosporno.blog网站回归测试
    当用户在首页搜索框输入"xvideosporno.blog"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.25,0.46)
    而且用户检查工具栏窗口
    当用户在当前页面点击坐标(0.25,0.44)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景大纲: ok.porn、pornhat.com网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    而且用户在当前页面点击关闭广告按钮
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word        | x   | y    |
      | ok.porn     | 0.5 | 0.59 |
      | pornhat.com | 0.5 | 0.64 |