# language: zh-CN
功能: all1 top100网站回归测试

  场景: tiktok.com网站回归测试
    当用户在首页搜索框输入"tiktok.com"
    那么用户应该看到悬浮按钮亮起
    而且用户在当前页面点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景大纲: xvideos系列网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户在当前页面点击坐标(0.5,0.35)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            |
      | www.xvideos.com |
      | www.xvideos.es  |

  场景大纲: xnxx系列网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.47,0.6)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    而且用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户在当前页面点击坐标(0.48,0.51)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word                |
      | www.xnxx.es         |
      | www.xnxx-arabic.com |
      | www.xnxx2.com       |
      | www.xnxx.com        |
      | www.xnxx.tv         |
      | www.txnhh.com       |

  场景大纲: pornhub系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮1
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击第1个下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户在当前页面点击坐标(0.5,0.6)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            |
      | es.pornhub.com  |
      | www.pornhub.com |
      | fr.pornhub.com  |
      | pt.pornhub.com  |

  场景大纲: xhamster.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮2
    而且用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            | x    | y    |
      | xhamster.com    | 0.25 | 0.65 |
      | xhwide5.com     | 0.7 | 0.65 |
      | xhamster.desi   | 0.25 | 0.82 |
      | xhamster42.desi | 0.75 | 0.82 |
      | es.xhamster.com | 0.25 | 0.65 |

  场景: dailymotion.com网站回归测试
    当用户在首页点击dailymotion图标
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.4)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景大纲: spankbang.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮3
    而且用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word             | x    | y    |
      | spankbang.com    | 0.25 | 0.57 |
      | la.spankbang.com | 0.75 | 0.57 |

  场景大纲: redtube.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮4
    而且用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word           | x    | y   |
      | redtube.com    | 0.25 | 0.5 |
      | redtube.com.br | 0.25 | 0.5 |

  场景大纲: 单个视频网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word               | x    | y    |
      | alarbda.com        | 0.5  | 0.75 |
      | www.sex1x.com      | 0.5  | 0.6  |
      | www.xnx33.com      | 0.5  | 0.6  |
      | xnxxsex.net        | 0.5  | 0.4  |
      | www.tokyvideo.com  | 0.5  | 0.4  |
      | www.abozeb.com     | 0.5  | 0.6  |
      | www.kobiiys.com    | 0.73 | 0.32 |
      | 3gpking.name       | 0.75 | 0.35 |
      | arabysexy.mobi     | 0.5  | 0.45 |
      | www.serviporno.com | 0.75 | 0.32 |
      | kompoz2.com        | 0.75 | 0.32 |
      | www.superporn.com  | 0.5  | 0.4  |
      | yatv.red           | 0.73 | 0.4  |
      | yako.pro           | 0.25 | 0.47 |
      | www.clip2vip.com   | 0.5  | 0.5  |
      | www.porndotcom.org | 0.75 | 0.4  |
      | xnxx.com.se        | 0.5  | 0.6  |
      | 3rabxn.com         | 0.5  | 0.6  |
      | arab-xn.com        | 0.5  | 0.7  |
      | www.wapoz.info     | 0.72 | 0.3  |
      | ijavhd.com         | 0.75 | 0.62 |
      | xxxbule.com        | 0.51 | 0.71 |
      | sex1x.com          | 0.5  | 0.5  |
      | pornocarioca.com   | 0.75 | 0.49 |
      | bucetaflix.com     | 0.75 | 0.61 |
      | hdsex.org          | 0.5  | 0.6  |
      | fngml.com          | 0.5  | 0.5  |

  场景大纲: 多个视频网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word                    | x    | y    |
      | www.eporner.com         | 0.25 | 0.6  |
      | www.arbada.com          | 0.46 | 0.65 |
      | www.ixxx1.com           | 0.51 | 0.73 |
      | sexalarab.com           | 0.5  | 0.5  |
      | www.aparat.com          | 0.52 | 0.4  |
      | www.watchxn.com         | 0.5  | 0.8  |
      | www.arabxn.com          | 0.5  | 0.75 |
      | pornhat.video           | 0.72 | 0.45 |
      | fpo.xxx                 | 0.5  | 0.5  |
      | tv.naver.com            | 0.5  | 0.38 |
      | porndig.com             | 0.75 | 0.46 |
      | xlxx69.com              | 0.5  | 0.5  |
      | pornes.xxx              | 0.75 | 0.33 |
      | tnaflix.com             | 0.5  | 0.6  |
      | pornoeggs.com           | 0.5  | 0.5  |
      | tukif.com               | 0.75 | 0.5  |
      | mrvideospornogratis.xxx | 0.5  | 0.58 |
      | www.xvideos-ar.com      | 0.5  | 0.35 |
      | www.xvv1deos.com        | 0.5  | 0.35 |
      | sex-alarabi.com         | 0.5  | 0.45 |

  场景大纲: 单个或多个视频网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户尝试点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word                | x    | y    |
      | sex-arabe.com       | 0.5  | 0.5  |
      | cinepornogratis.com | 0.5  | 0.5  |
      | sexalarbda.com      | 0.25 | 0.66 |
      | cnnamador.com       | 0.45 | 0.72 |
      | xvideosincesto.com  | 0.5  | 0.42 |

  场景大纲: 搜索类网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户在搜索框输入"<txt>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.55)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word               | txt   |
      | noodlemagazine.com | henti |
      | mat6tube.com       | more  |

  场景大纲: www.arabsex.to、sex-alarabi.com网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    而且用户点击底部工具栏窗口按钮
    而且用户点击第1个窗口的关闭按钮
    而且用户点击空白位置
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word           | x    | y   |
      | www.arabsex.to | 0.25 | 0.6 |
      | pornxp.quest   | 0.5  | 0.5 |

  场景大纲: sex-arebi.com、sex4arab.xxx网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    而且用户点击底部工具栏窗口按钮
    而且用户点击第1个窗口的关闭按钮
    而且用户点击空白位置
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            | x    | y   |
      | sex-arebi.com   | 0.5  | 0.5 |
      | sex4arab.xxx    | 0.5  | 0.5 |
      | capetinhas.blog | 0.75 | 0.4 |
      | filmesporno.xxx | 0.72 | 0.5 |

  场景: xnxx.health网站回归测试
    当用户在首页搜索框输入"xnxx.health"
    而且用户向上滑动
    而且用户在当前页面点击坐标(0.5,0.6)
    而且用户点击底部工具栏窗口按钮
    而且用户点击第1个窗口的关闭按钮
    而且用户点击空白位置
    而且用户向上滑动
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    而且用户在下载列表点击第1个下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户在当前页面点击坐标(0.5,0.6)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: sexallarab.com网站回归测试
    当用户在首页搜索框输入"sexallarab.com"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.51,0.51)
    而且用户在当前页面点击播放按钮1
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: www.arabx.cam网站回归测试
    当用户在首页搜索框输入"www.arabx.cam"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.55)
    而且用户点击底部工具栏窗口按钮
    而且用户点击第1个窗口的关闭按钮
    而且用户点击空白位置
    而且用户在当前页面点击播放按钮2
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: sm3ha.mx网站回归测试
    当用户在首页搜索框输入"sm3ha.mx"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.39)
    而且用户在当前点击第1条结果
    而且用户在当前页面点击播放按钮3
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击第1个下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: jerk24.com网站回归测试
    当用户在首页搜索框输入"jerk24.com"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.75,0.38)
    而且用户在当前页面点击坐标(0.75,0.55)
    而且用户在当前页面点击播放按钮2
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击第1个下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: www.tubev.sex网站回归测试
    当用户在首页搜索框输入"www.tubev.sex"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.72,0.52)
    而且用户在当前页面点击坐标(0.71,0.61)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: kudosporn.com网站回归测试
    当用户在首页搜索框输入"kudosporn.com"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.75,0.53)
    而且用户在当前页面点击坐标(0.75,0.43)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: xvideosporno.blog网站回归测试
    当用户在首页搜索框输入"xvideosporno.blog"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.25,0.46)
    而且用户检查工具栏窗口
    当用户在当前页面点击坐标(0.25,0.43)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: xvideosporno.blog.br网站回归测试
    当用户在首页搜索框输入"xvideosporno.blog.br"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.36,0.52)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: twister.porn网站回归测试
    当用户在首页搜索框输入"twister.porn"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.25,0.38)
    而且用户在当前页面点击坐标(0.75,0.4)
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景大纲: ok.porn、pornhat.com网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    而且用户在当前页面点击关闭广告按钮
    那么用户应该看到悬浮按钮亮起
    当用户在当前页面点击悬浮下载按钮
    那么用户用户应该看到下载列表
    当用户在下载列表点击Download按钮
    那么用户应该看到下载进度页
    当用户在下载进度页点击关闭按钮
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word        | x   | y    |
      | ok.porn     | 0.5 | 0.6  |
      | pornhat.com | 0.5 | 0.65 |