# language: zh-CN
功能: all1 top100网站回归测试

  场景大纲: pornhub系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户向上滑动页面1次
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户在当前页面点击坐标(0.5,0.31)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            |
      | www.pornhub.com |
      | es.pornhub.com  |
      | fr.pornhub.com  |
      | pt.pornhub.com  |

  场景大纲: redtube.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮1
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word           | x    | y    |
      | redtube.com    | 0.25 | 0.48 |
      | redtube.com.br | 0.25 | 0.48 |
      | txxx.com       | 0.26 | 0.31 |

  场景大纲: xhamster.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮2
    而且用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            | x    | y    |
      | xhamster.com    | 0.26 | 0.62 |
      | xhwide5.com     | 0.74 | 0.62 |
      | xhamster.desi   | 0.26 | 0.82 |
      | xhamster42.desi | 0.74 | 0.82 |

  场景大纲: spankbang.com系列网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户点击同意按钮3
    当用户在当前页面点击坐标(<x>,<y>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word             | x    | y   |
      | la.spankbang.com | 0.74 | 0.8 |
      | spankbang.com    | 0.26 | 0.8 |

  场景大纲: xvideos系列网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户在当前页面点击坐标(0.5,0.33)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            |
      | www.xvideos.com |
      | www.xvideos.es  |

  场景大纲: xnxx系列网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.6)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户在当前页面点击坐标(0.5,0.5)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word                |
      | www.xnxx.es         |
      | www.xnxx-arabic.com |
      | www.xnxx2.com       |
      | www.xnxx.com        |
      | www.xnxx.tv         |
      | www.txnhh.com       |