# language: zh-CN
功能: all1 top100网站回归测试

  场景大纲: 搜索类网站回归测试
    当用户在首页搜索框输入"<word>"
    而且用户在搜索框输入"<txt>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.48)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word               | txt  |
      | noodlemagazine.com | snow |
      | mat6tube.com       | more |

  场景大纲: 打开新窗口类网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    而且用户检查工具栏窗口
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word            | x    | y    |
      | sexmtrgm.com    | 0.5  | 0.49 |
      | www.arabsex.to  | 0.26 | 0.6  |
      | capetinhas.blog | 0.26 | 0.4  |
      | sex-arebi.com   | 0.5  | 0.51 |
      | sex4arab.xxx    | 0.5  | 0.5  |
      | filmesporno.xxx | 0.75 | 0.5  |
      | sex-alarabi.com | 0.5  | 0.49 |
      | sexsati.com     | 0.74 | 0.47 |
      | pussyboy.net    | 0.5  | 0.47 |

  场景: rusoska网站回归测试
    当用户在首页搜索框输入"x10.rusoska.mobi"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.6)
    而且用户检查工具栏窗口
    当用户在当前页面点击坐标(0.5,0.66)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: xnxx.health网站回归测试
    当用户在首页搜索框输入"xnxx.health"
    而且用户向上滑动页面2次
    而且用户在当前页面点击坐标(0.5,0.81)
    而且用户检查工具栏窗口
    而且用户向上滑动页面2次
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户在当前页面点击坐标(0.5,0.68)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: sexallarab.com网站回归测试
    当用户在首页搜索框输入"sexallarab.com"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.46)
    而且用户在当前页面点击播放按钮1
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: www.arabx.cam网站回归测试
    当用户在首页搜索框输入"www.arabx.cam"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.47)
    而且用户检查工具栏窗口
    而且用户在当前页面点击播放按钮2
    而且用户检查工具栏窗口
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: jerk24.com网站回归测试
    当用户在首页搜索框输入"jerk24.com"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.75,0.39)
    而且用户在当前页面点击坐标(0.75,0.55)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景: sm3ha.mx网站回归测试
    当用户在首页搜索框输入"sm3ha.mx"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.5,0.39)
    而且用户在当前点击结果1
    而且用户在当前页面点击播放按钮3
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户检查下载页存在
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景大纲: tubev、kudosporn网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x1>,<y1>)
    而且用户在当前页面点击坐标(<x2>,<y2>)
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word          | x1   | y1   | x2   | y2   |
      | www.tubev.sex | 0.73 | 0.52 | 0.73 | 0.64 |
      | kudosporn.com | 0.75 | 0.54 | 0.75 | 0.44 |
      | twister.porn  | 0.25 | 0.38 | 0.25 | 0.42 |

  场景: xvideosporno.blog网站回归测试
    当用户在首页搜索框输入"xvideosporno.blog"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(0.25,0.46)
    而且用户检查工具栏窗口
    当用户在当前页面点击坐标(0.25,0.44)
    而且用户检查工具栏窗口
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页

  场景大纲: ok.porn、pornhat.com网站回归测试
    当用户在首页搜索框输入"<word>"
    那么用户应该看到悬浮按钮
    当用户在当前页面点击坐标(<x>,<y>)
    而且用户在当前页面点击关闭广告按钮
    那么用户应该看到悬浮按钮亮起
    当用户点击悬浮下载按钮
    那么用户应该看到下载进度页
    当用户点击返回键
    而且用户点击底部工具栏主页按钮
    那么用户应该看到主页
    例子:
      | word        | x   | y    |
      | ok.porn     | 0.5 | 0.59 |
      | pornhat.com | 0.5 | 0.64 |
      | ok.xxx      | 0.5 | 0.64 |